/* eslint-disable prefer-const */
/* eslint-disable semi */
/* eslint-disable no-unused-vars */

'strict';

// Это задание выполняется отдельно от нашего проекта с бюджетом!
// Для этого задания создайте отдельный репозиторий.

// Для выполнения задания можно использовать готовую верстку или сверстать самостоятельно

// Напишем свой ToDo List

// Посмотрите дополнительное видео в уроке

// Что необходимо реализовать (первые 2 пункта делаем по видео):

// Отмечать выполненные дела, выполненные дела должны перемещаться в блок с выполненными делами
// Поле ввода после добавления дела должно очищаться
// Пустые дела добавляться не должны
// Удаление дел на кнопку КОРЗИНА
// Сохранять данные о делах в localStorage (советую в виде массива)
// Дела из localStorage подгружаться должны автоматически при загрузки странице

// внимание чтобы сохранить массив в localStorage необходимо его конвертировать в json формат (JSON.stringify)

// внимание из localStorage мы всегда получаем json строку и её необходимо конвертировать обратно в формат javascript (JSON.parse)

//  Проверить, чтобы все работало и не было ошибок в консоли (Учесть вариант отсутствия объекта в localstorage пользователя при первой загрузке страницы)

//  Сохранить проект в отдельном репозитории на GitHub
